import React, {useState} from "react";
import c from "./Blog.module.scss"
import Leader from "../Work/Leader/Leader";
import {socialNetworks} from "../../../config/network";
import BlogMeText from "../../comon/Blog/BlogMeText/BlogMeText";
import BlogMeTitle from "../../comon/Blog/BlogMeTitle/BlogMeTitle";
import BlogMeImg from "../../comon/Blog/BlogMeImg/BlogMeImg";
import Network from "./Network/Network";


const Blog = (props) => {
    const [networks, setNetwork] = useState(socialNetworks);

    return <div>
        <div className={c.title}>
            <Leader comeback="Back to Work" text="Diter Rams" to="/work"/>
        </div>
        <div className={c.text}>
            <div className={c.item}>Фундаментальні правила гарного дизайну від німецького дизайнера Дітера Рамса</div>
        </div>
        <div className={c.network}>
            <Network/>
        </div>
        <div className={c.image}>
            <img className={c.img}  src="./img/Rectangle 148088.png"/>
        </div>
        <div className={c.container}>
            <BlogMeText
                text="Дітер Рамс, відомий німецький дизайнер, який розробив десять принципів дизайну, які стали фундаментальними та вплинули на розвиток сучасного дизайну. Детальніше про принципи:"/>
            <BlogMeTitle title="Гарний дизайн — інноваційний дизайн"/>
            <div className={c.inf}>
                Технологічний прогрес постійно відкриває нові можливості для інноваційного дизайну.
                Нові матеріали, виробничі процеси та технології надають дизайнерам дахосносні можливості для створення
                інноваційних рішень.
                Однак, пам’ятайте, що інновації в дизайні не мають бути самоціллю. Натомість вони мають стати засобом
                досягнення конкретної
                мети, наприклад, покращення функціональності, взаємодії з користувачем тощо.
                Інноваційний дизайн завжди повинен розвиватися в парі з інноваційними технологіями.
                Це означає, що дизайнери мають розуміти та використовувати новітні технології для створення нових
                рішень,
                які відповідатимуть потребам і бажанням користувачів.
            </div>
            <div className={c.padding}><BlogMeImg  img="./img/image 26.png"/></div>
            <BlogMeText text="Наприклад, інноваційний дизайн може допомогти створити простіші у використанні,
            більш інтуїтивно зрозумілі та більш екологічні продукти. Також, можуть посприяти створенню нових бізнес-моделей,
            які є більш ефективними, прибутковими та соціально відповідними.Інновації в дизайні вимагають глибокого розуміння потреб,
            уподобань і поведінки користувачів. Дизайнери повинні вміти визначати можливості для інновацій і перетворювати їх на значущі
             рішення. А такоє вміти ризикувати та експериментувати з новими ідеями, матеріалами та технологіями."/>
            <BlogMeTitle title="Гарний дизайн робить продукт корисним"/>
            <BlogMeText text="Один із фундаментальних принципів хорошого дизайну полягає в його корисності.
            Коли люди купують продукт, вони роблять це з наміром використовувати його (логічно, чи не так?) тож
            корисність продукту є критичним фактором його успіху."/>
            <BlogMeText text="Функціональність означає здатність продукту виконувати завдання, для якого він був розроблений.
            Корисним скоріш за все буде сприйматись продукт: простий у використанні, ефективний, функціональний, зручний і приємний у
             використанні. Наприклад, смартфон, яким легко керувати, який зручно тримати в руці, який має привабливий дизайн.
             Це є прямим прикладом корисного продукту."/>
            <div className={c.padding}><BlogMeImg img="./img/image-29.png.png"/></div>
            <BlogMeText text="Естетика також може відіграти значну роль в успіху продукту, оскільки людей часто приваблюють саме візуально привабливі
            продукти. Хороший дизайн підкреслює корисність продукту, ігноруючи все, що могло б його погіршити. Наприклад, дизайнер може вирішити
             спростити дизайн продукту, видаливши непотрібні елементи чи прикраси, які б погіршили його функціональність."/>
            <BlogMeTitle title="Гарний дизайн — естетичний"/>
            <BlogMeText text="Гарний дизайн — це не лише функціональність і зручність використання, а також про естетику продукту.
             Естетичний аспект дизайну є критично важливим, оскільки він впливає на наше сприйняття та взаємодію з продуктом,
             яким користуємося щодня. Хороший дизайн має прагнути до створення красивих і естетично привабливих продуктів, які,
             на додачу, покращують наше життя."/>
            <BlogMeText text="Естетична якість продукту є невідільною частиною його корисності, оскільки вона безпосередньо впливає на наш
            досвід роботи з продуктом. Наприклад, кавова чашка з гарним дизайном, яку зручно тримати в руках — виглядає привабливо, отже, може
            зробити наш ранковий ритуал кави більш приємним і розслаблюючим. Подібним чином добре сконструйоване крісло може забезпечити зручне
            та візуально приємне місце для сидіння, покращуючи наш настрій та продуктивність."/>
            <div className={c.image_blog}>
                <div className={c.item_img1}><BlogMeImg  img="./img/Never-Ending-Content.png.png"/></div>
                <div className={c.item_img2}><BlogMeImg  img="./img/Never-Ending-Content.png(2).png"/></div>
                <div className={c.item_img3}><BlogMeImg  img="./img/Never-Ending-Content.png(3).png"/></div>
            </div>
            <div className={c.padding}><BlogMeImg text="https://www.behance.net/benfearnley"/></div>
            <BlogMeText text="Краса в дизайні полягає не лише у формі та зовнішньому вигляді продукту;
            це також стосується якості дизайну та його виконання. Добре виконані об’єкти – це ті, які були ретельно
            створені з увагою до деталей і глибоким розумінням потреб і бажань користувача. Тільки такі предмети можна вважати
            по-справжньому красивими й естетично привабливими. Дизайнери повинні враховувати естетичну якість продукту з самого початку
             процесу проєктування. Слід приділити увагу кожній деталі, включаючи форму, колір, текстуру і загальну композицію.
             Якість та естетика мають стати для вас синонімами."/>
            <BlogMeTitle title="Гарний дизайн робить продукт зрозумілим"/>
            <BlogMeText text="Дизайн — це не лише створення продуктів, які добре виглядають і добре функціонують; це також
            створення продуктів, які легко зрозуміти та використовувати. Хороший дизайн робить продукт зрозумілим, прояснюючи його
             структуру та полегшуючи взаємодію з ним. Це надзвичайно важливо, тому що продукт, який важко зрозуміти, може бути розчаровуючим
              і неефективним, тоді як продукт, який легко зрозуміти, може бути менш функціональним, але більш ефективним саме для користувача."/>
            <BlogMeText text="Як цього досягти? Використовуйте візуальні підказки, щоб керувати користувачем, наприклад кольорове кодування, значки та текстові
            мітки. Також можете використовувати чітку та стислу мову для пояснення призначення та функції продукту.
            Використовуйте максимально інтуїтивно зрозумілі функції дизайну, які зроблять продукт простішим, наприклад прості інтерфейси
            та легкі для виконання інструкції."/>
            <div className={c.img_item}><BlogMeImg  img="./img/--------------2023-03-07---18.32.20.png.png"
                                                  text="https://www.behance.net/JerryKong"/></div>
            <BlogMeText text="Гарний дизайн може виходити за рамки звичайної зрозумілості продукту; за допомогою дизайну ви
            можете змусити продукт говорити. Використовуючи елементи дизайну, які передають інформацію та відгуки, продукт
            може надати користувачеві більш привабливий та інформативний досвід. Наприклад, приладова панель автомобіля, яка
             використовує чіткі значки та дисплеї для відображення швидкості автомобіля та рівня палива, набагато ефективніша,
              ніж та, яка показує лише цифри та прилади."/>
            <BlogMeText text="Отже, продукт має бути розроблений таким чином, щоб його призначення та функції були одразу зрозумілі
             користувачеві, без необхідності додаткових пояснень чи інструкцій.Це вимагає ретельного розгляду кожного аспекту дизайну,
             від форми продукту до його інтерфейсу та взаємодії з користувачем."/>
            <BlogMeTitle title="Гарний дизайн — ненав'язливий"/>
            <BlogMeText text="Добре розроблений продукт – це той, який не відволікає й не погіршує досвід користувача, а натомість покращує
            його. Коли ми думаємо про продукти як про інструменти, ми розуміємо, що вони покликані служити певній меті. Будь то кухонний гаджет
             чи частина програмного забезпечення, продукт призначений для того, щоб допомогти нам чогось досягти.
             Дизайн продукту повинен відображати цю мету і не заважати їй. Іншими словами, дизайн продукту повинен бути нейтральним і
              стриманим, дозволяючи користувачеві зосередитися на власних потребах і цілях."/>
            <BlogMeText text="Хороший дизайн також повинен залишати простір для самовираження користувача. Хоча дизайн продукту має бути
            ненав’язливим, він не повинен бути повністю позбавлений індивідуальності чи характеру. Дизайн має бути досить витонченим, щоб не
            заважати користувачеві, але все ж мати достатньо характеру, щоб зробити продукт запам’ятовуваним і приємним у використанні."/>
            <div className={c.img_item1}><BlogMeImg  img="./img/--------------2023-03-07---18.28.49.png.png"
                                                  text="https://www.behance.net/pipi5182c08"/></div>
            <BlogMeText text="Чудовим прикладом ненав'язливого дизайну є скромний олівець. Олівець - простий інструмент, яким ми
            пишемо чи малюємо. Дизайн олівця мінімальний, з довгим тонким корпусом і маленькою гумкою на одному кінці. Колір і обробка
            олівця можуть відрізнятися, але в цілому дизайн простий і ненав'язливий, що дозволяє користувачеві зосередитися на роботі."/>
            <BlogMeText text="З іншого боку, погано сконструйований продукт може відволікати та розчаровувати у використанні.Подумайте про
            веб-сайт із занадто великою кількістю спливаючих вікон або предмет меблів, який важко зібрати. Ці конструкції заважають
             досягненню цілей продукту, ускладнюючи для користувача досягнення своїх цілей."/>
            <BlogMeText text="З іншого боку, погано сконструйований продукт може відволікати та розчаровувати у використанні.
            Подумайте про веб-сайт із занадто великою кількістю спливаючих вікон або предмет меблів, який важко зібрати.
            Ці конструкції заважають досягненню цілей продукту, ускладнюючи для користувача досягнення своїх цілей."/>
            <BlogMeTitle title="Гарний дизайн — чесний"/>
            <BlogMeText text="На сучасному ринку, орієнтованому на споживачів, компанії постійно змагаються за створення продуктів,
             які відрізнятимуться від інших. Це призвело до зростання маркетингових тактик, які перебільшують переваги продукту або роблять
              неправдиві твердження щодо його властивостей. У результаті споживачі стали більш скептичними та все більше вимагають від
              компаній прозорості та чесності."/>
            <BlogMeText text="Ось тут і вступає в дію принцип чесності. Хороший дизайн не робить продукт більш інноваційним, потужним або
            цінним, ніж він є насправді. Натомість він представляє продукт таким, яким він є насправді, без будь-яких хитрощів чи перебільшень.
            Такий підхід не тільки створює довіру між споживачем і компанією, але й дозволяє продукту говорити сам за себе."/>
            <div className={c.img_item1}><BlogMeImg img="./img/--------------2023-03-07---18.27.45.png.png"
                                                  text="https://www.behance.net/envato_elements"/></div>
            <BlogMeText text="Коли продукт продається чесно та прозоро, це дозволяє споживачам приймати обґрунтовані рішення щодо того, що
            вони купують. Вони можуть бути впевнені, що продукт працюватиме так, як рекламується, і що компанія не намагається маніпулювати
             ними за допомогою фальшивих обіцянок або заяв. Це також допомагає побудувати довготривалі стосунки між споживачем і брендом,
             оскільки споживач відчуває, що його цінують і поважають."/>
            <BlogMeText text="Коли компанія використовує нечесну тактику для просування своєї продукції, це може мати негативний вплив на її
             репутацію. Споживачі можуть відчувати себе зрадженими та ошуканими, що призводить до втрати довіри до бренду. Що також може сприяти
             зниженню продажів та негативних відгуків."/>
            <BlogMeText text="Отже, чесність і прозорість зміцнюють довіру та допомагають встановити міцні стосунки між споживачем і брендом.
            Зосереджуючись на справжніх перевагах продукту, компанії можуть створювати продукти, які витримують випробування часом, і
             підтримуватимуть базу лояльних клієнтів."/>
            <BlogMeTitle title="Гарний дизайн — довготривалий"/>
            <BlogMeText text="У світі, де тенденції та мода швидко змінюються, легко потрапити в пастку, створюючи дизайни, актуальні лише
            протягом короткого трендового періоду. Однак, хороший дизайн просто вимагає бути не лише корисними та естетично привабливими,
             але й довговічним."/>
            <BlogMeText text="Хороший дизайн не прив'язаний до якоїсь епохи чи течії. Він поза часом і може залишатися актуальним десятиліттями,
             а то й століттями. Згадайте про класичний дизайн, наприклад, крісло Eames Lounge або Volkswagen Beetle. Ці конструкції зберігаються
             десятиліттями, тому що вони не тільки стильні, але й функціональні та добре виготовлені."/>
            <div className={c.img_item1}><BlogMeImg  img="./img/image-32.png.png"/></div>
            <BlogMeText text="Одна з ключових причин довговічності хорошого дизайну полягає в тому, що він не підкоряється примхам моди. Тренди приходять
            і йдуть, не впливаючи на класичний якісний дизайн. Такий дизайн вимагає ретельного розгляду кожного аспекту продукту та уваги до
             деталей. Отже, йдеться про створення чогось, що витримає випробування часом і залишиться актуальним протягом багатьох років."/>
            <BlogMeTitle title="Гарний дизайн продуманий до деталей"/>
            <BlogMeText text="Коли ми говоримо про продуманий до деталей дизайн, ми маємо на увазі, що враховано буде абсолютно все.
             Жодна деталь не буде пропущена чи упущена. Процес проєктування має бути ретельним і точним, враховуючи всі можливі фактори,
             які могли б вплинути на продукт."/>
            <div className={c.img_item1}><BlogMeImg  img="./img/--------------2023-03-07---18.34.19.png.png"/></div>
            <BlogMeText text="Така скрупульозність допоможе покращити загальну якість продукту. Коли кожен аспект дизайну
             ретельно вивчено та оцінено, більш імовірно, що потенційні проблеми будуть виявлені та вирішені до виходу продукту
             на ринок. Гарно розроблений продукт, ретельно продуманий і виконаний, є свідченням цінності та важливості продукту."/>
            <BlogMeTitle title="Гарний дизайн — екологічний"/>
            <BlogMeText text="У сучасному світі турбота про навколишнє середовище стала вирішальним фактором у розробці продуктів.
            Дизайнери мають враховувати вплив продукції на навколишнє середовище. Використані матеріали, виробничий процес, споживана енергія
            та утилізація виробу після використання – все це важливі аспекти. Мета полягає в мінімізації негативного впливу на навколишнє
            середовище протягом усього життєвого циклу продукту."/>
            <div className={c.img_item1}><BlogMeImg  img="./img/--------------2023-03-07---18.38.00.png.png"
                                                  text="https://pradoecostudio.com"/></div>
            <BlogMeText text="Одним із ключових аспектів екологічно чистого дизайну є використання екологічно чистих
             матеріалів. Дизайнери віддають перевагу матеріалам, які можна відновлювати, переробляти та біологічно розкладати.
              Іншим способом досягнення екологічної стійкості є мінімізація споживаної енергії протягом життєвого циклу продукту.
               Наприклад, дизайнери можуть створювати продукти, які потребують менше енергії для виробництва, транспортування та використання."/>
            <BlogMeText text=" Отже, екологічно чистий дизайн — це створення продуктів, які мінімізують їхній негативний вплив на
             навколишнє середовище. Дизайнери повинні враховувати використані матеріали, споживану енергію та утилізацію продукту після
             його використання."/>
            <BlogMeTitle title="Гарний дизайн – це якомога менше дизайну"/>
            <BlogMeText text="Гарний дизайн — це не лише про додавання елементів до продукту, а й усунення непотрібних функцій.
             Цей принцип відомий як «менше — це більше». Це означає, що дизайн продукту має бути простим і зосередженим на його основних
              функціях."/>
            <BlogMeText text="Розробляючи продукт, легко захопитися і додати забагато елементів. Однак захаращений дизайн може заплутати
            користувачів і навіть відвертати від цільового призначення продукту. Зосереджуючись на головному та виключаючи все непотрібне,
            дизайнери можуть створити простий та зрозумілий у використанні продукт."/>
            <div className={c.img_item1}><BlogMeImg  img="./img/--------------2023-03-07---18.49.02.png.png"
                                                  text="https://www.behance.net/JerryKong"/></div>
            <BlogMeText text="Крім того, простий дизайн часто може бути естетичнішим, ніж складний. Чіткі лінії та мінімалізм простого дизайну
             можуть надати продукту позачасову привабливість, яка не швидко застаріє (повертаючись до пункту про довготривалість дизайну).
              Це особливо важливо в галузях, де продукти служитимуть тривалий час, наприклад меблі чи побутова техніка."/>
            <BlogMeText text="Принцип «менше — це більше» підкреслює важливість простоти та есенціалізму в дизайні продукту. Зосереджуючись на
            основних функціях продукту та усуваючи непотрібні елементи, дизайнери можуть створювати прості у використанні, естетично привабливі
            та екологічно чисті продукти."/>


        </div>
    </div>
}
export default Blog;