import React from "react";
import c from "./Bloc4.module.scss"

const Bloc4 = (props) => {
    return (
        <div className={c.my_philosophy}>
            <div>Моя філософія</div>
            <div>поєднання інженерного підходу та візуальної естетики. Дизайн повинен бути функціональним та
                привабливим.
                Я об'єдную технічний досвід з естетичними принципами, створюючи продукти,
                які задовольнять потреби користувачів та матимуть чудовий зовнішній вигляд.
                Моя мета - зробити світ кращим через поєднання інженерних знань з візуальною естетикою.
            </div>
        </div>
    )
}

export default Bloc4;