export const project = {
    me: `<p>Привіт, я Назар. UX/UI дизайнер. Час від часу я беруся за фрілансерські проєкти, якщо
 вони відповідають моїм особистим цінностям. Зараз старший дизайнер у Bukovel..</p>`,
    principles: `<p>З самого старту я встановив принцип та параметр відбору, якими керуюся і сьогодні:
 український бренд з виробництвом в Україні, свідоме підприємництво, недопустимість співпраці 
 та будь-яких точок дотику з країнами-терористами.</p>`,
    mission: `<p> Світ стає все більш динамічним і складним. Швидкість, з якою з'являються нові ідеї та 
втілюються, надзвичайно висока порівняно з будь-яким іншим періодом часу, що надихає на позитивний оптимізм 
щодо майбутнього.</p>

<p>Швидкість та спритність стають ключовими факторами у бізнес-середовищі, від стартапів до великих 
корпорацій. Прискорення стало нормою. Однак, швидкий прогрес не повинен пожертвувати якістю та
 розмірковуванням. Тут і виникає зміст, який буде актуальний та корисний у майбутньому, підтримуючи людей
  у повсякденному житті. Як дизайнер, я відчуваєю відповідальність за використання обдуманого дизайну для 
  створення більш цінного, навіть змінного майбутнього.</p>

<p>Це починається з розуміння та ретельного ставлення до найнеобхідніших аспектів. 
Яка справжня проблема, яку ми намагаємось вирішити? Чи ми дійсно розглядаємо довгострокові наслідки 
наших рішень? Чи можемо ми поліпшити, а не просто додавати? Можливо, ми зможемо спростити, 
а не ускладнювати?</p>`,

    work: `<p>Хороша робота вимагає часу,
зобов'язання і закрити
співпраця. Ми цінуємо довго-
тривалі стосунки де
довіра, відкритість і прогрес
стати водієм для
процес. Спільний набір цінностей
є істотним.</p>
        <p>Студія народилася в 2016 році
з прагненням творити
порядку в дедалі більше
складна конвергенція між
бізнес і дизайн. Заснована в
Данія, з якою ми працюємо
амбітні корпорації,
стартапи та окремі особи з усього світу
світ.</p>
        <p>Moseichuk засновано та очолюється
міжнародно визнаними
дизайнери Максимом та Євгеном
з глобальною мережею
незалежні співавтори
підтримка студії
дисципліни.</p>
        <p>Максимом та Євгеном</p>`,
    mainPhoto: "./img/Img.png",
    works: {
        process: 'Процес',
        process_text: `<p>Мій процес зосереджений на тому, щоб виявити головне та дозволити йому спрямовувати
 подальший шлях. Я спираюся на 4 основні кроки, які допомагають мені рухатися вперед. В основі процесу лежить
  прозорий, ітеративний та спільний підхід, який створює основу для успішного партнерства.</p>`,
        items: [{
            id: 1,
            number: '1',
            topic: `Статистика та Творчий підхід`,
            description: `Уточнення та переклад\n уявлення про фундамент і творчий підхід.`
        },{
            id: 2,
            number: '2',
            topic: 'Концепція та\n' +
                'Стратегія дизайну',
            description: 'Спрямування творчості\n' +
                'підхід до понять і\n' +
                'стратегія дизайну.',
        },{
            id: 3,
            number: '3',
            topic: 'Дизайнерські \n' +
                'дослідження & \n' +
                'Напрямок дизайну',
            description: 'Використання стратегії проектування для досліджувати та визначати нове напрям дизайну.',
        },{
            id: 4,
            number: '4',
            topic: 'виробництво & Реалізація',
            description: 'Виробництво та реалізація через точки дотику на основі новий напрямок.',
        }],
        service: 'Послуги',
        service_text: `<p>Допомагаю брендам уявити та протестувати майбутній бізнес-потенціал, створюю
             унікальні мови дизайну та виводжу на ринок нові продукти та послуги. Незалежно від результату,
            прагну запропонувати нові погляди на усталені припущення, методи та рішення.</p>`,
        my_client:'Мої клієнти',
        my_client_text:`<p>Працюємо з клієнтами з усіх секторів на основі спільного набору цінностей та бачення того,
 як створити краще майбутнє за допомогою дизайну.</p>`

    },
    formation:`<p>На основі досліджень та інтуїції ми уявляємо, формулюємо та візуалізуємо основу, на 
якій може існувати бренд, продукт чи послуга.<p/>

<p>Креативний напрямок
Дизайнерський напрямок
Інсайти
Неймінг
Прототипування
Дослідження
Стратегія
Тон голосу<p/>`,
    creation: `<p>На основі перевірених і підтверджених припущень ми розробляємо і створюємо реальні 
елементи, які формують досвід бренду або продукту на всіх точках дотику.</p>
<p>
Додатки
Анімація
Копірайтинг
Дизайн бренду
Розробка
Цифровий дизайн продуктів
Фотографія
Презентації
Прототипи
Веб-сайти та платформи</p>`,
        brand: [{
            id: 1,
            name: 'Мууто'
        }, {
            id: 2,
            name: 'ПРОСТОР10'
        }, {
            id: 3,
            name: 'IKEA'
        }, {
            id: 4,
            name: 'NIKE'
        }, {
            id: 5,
            name: 'Нуро'
        }, {
            id: 6,
            name: 'AWS'
        }, {
            id: 7,
            name: 'Google ATAP'
        }, {
            id: 8,
            name: 'Мітте'
        }],
    works_me: {
        startYears: '2016—2023 роки',
        endYears: '2016—2023 роки',
        text:'Роботи',
        items: [{
            id:1,
            image:'./img/work.png',
            author: 'Annual Awwwards',
            topic: 'Brand Design',
            description: 'Nova Post Advent Calendar',
        },{
            id: 2,
            image:'./img/work2.png',
            author: 'Annual Awwwards',
            topic: 'Brand Design',
            description: 'Nova Post Advent Calendar',
        }]
    }
}